# Avance Proyecto

In [15]:
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

d002 -> Tarakawa, Kiribati (1.3320m 172.01300)
d003 -> Baltra, Ecuador (-0.43700, -90.28500)
d004 -> Nauru, Nauru (-0.52800, 166.90500)
d011 -> Christmas, Kiribati (1.98500, -157.47700)
d013 -> Kanton, Kiribati (-2.81000, -171.71800)
d029 -> Kapingamarangi, Micronesia (1.09800, 154.77700) 
d030 -> Santa Cruz, Ecuador (-0.75500, -90.31300)
d091 -> La Libertad, Ecuador (-2.20000, -80.91700)
d092 -> Talara, Peru (-4.58200, -81.28200)
d400 -> Lombrum, Papua New Guinea (-2.03300, 147.36700)

In [2]:
#Sea level datafram
df = pd.read_csv('data/sea level center/d002.csv', names=['Year', 'Month', 'Day', 'd002'])
df.head()

   Year  Month  Day  d002
0  1992     12    4  1711
1  1992     12    5  1693
2  1992     12    6  1671
3  1992     12    7  1680
4  1992     12    8  1700

In [3]:
# Merge

df_names = ['d003', 'd004', 'd011', 'd013', 'd029', 'd030', 'd091', 'd092', 'd400']

for n in df_names:
    path = 'data/sea level center/{}.csv'.format(n)
    d_right = pd.read_csv(path, names=['Year', 'Month', 'Day', n])
    df = df.merge(d_right, how='outer', on=['Year', 'Month', 'Day'])

In [4]:
df.sort_values(by=['Year', 'Month', 'Day'], inplace=True)
df.reset_index(inplace=True)

df

,index,Year,Month,Day,d002,d003,d004,d011,d013,d029,d030,d091,d092,d400
0,17957,1949,9,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2166.0,NaN,NaN
1,17958,1949,9,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2185.0,NaN,NaN
2,17959,1949,9,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2092.0,NaN,NaN
3,17960,1949,9,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2081.0,NaN,NaN
4,17961,1949,9,6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2130.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
26230,10431,2021,6,26,1692.0,1880.0,1507.0,NaN,1071.0,1029.0,1522.0,NaN,NaN,794.0
26231,10432,2021,6,27,1672.0,1905.0,1473.0,NaN,1052.0,1014.0,1512.0,NaN,NaN,790.0
26232,10433,2021,6,28,1658.0,1914.0,1460.0,NaN,1040.0,NaN,1509.0,NaN,NaN,802.0
26233,10434,2021,6,29,1678.0,1922.0,1480.0,NaN,1072.0,NaN,1504.0,NaN,NaN,814.0
26234,10435,2021,6,30,1694.0,1917.0,1493.0,NaN,1092.0,NaN,1511.0,NaN,NaN,824.0

In [ ]:
df.to_csv('dataframe.csv')

## 3) Relacion entre periodo de 1970-1984 a 1984-2020

In [42]:
# Dataframe 1970 a 1984
df_70_84 = df.loc[(df['Year']>=1970) & (df['Year']<=1984) ]

# Dataframe 1985 - 2020
df_85_20 = df.loc[ (df['Year']>1984) & (df['Year']<= 2020) ]

In [43]:
df_70_84.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5479 entries, 7426 to 12904
Data columns (total 14 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   5479 non-null   int64
 1   Year    5479 non-null   int64
 2   Month   5479 non-null   int64
 3   Day     5479 non-null   int64
 4   d002    0 non-null      float64
 5   d003    0 non-null      float64
 6   d004    0 non-null      float64
 7   d011    3981 non-null   float64
 8   d013    4627 non-null   float64
 9   d029    2306 non-null   float64
 10  d030    2265 non-null   float64
 11  d091    5479 non-null   float64
 12  d092    0 non-null      float64
 13  d400    0 non-null      float64
dtypes: float64(10), int64(4)
memory usage: 642.1 KB

In [44]:
# Valores nulos por estacion
df_70_84.isnull().sum()

index       0
Year        0
Month       0
Day         0
d002     5479
d003     5479
d004     5479
d011     1498
d013      852
d029     3173
d030     3214
d091        0
d092     5479
d400     5479
dtype: int64

In [45]:
# Solo se analizará la estacion 011, 013, 029, 030, 091
df_70_84 = df_70_84[['Year','Month','Day', 'd011', 'd013','d029','d030','d091']]
df_70_84

       Year  Month  Day   d011    d013    d029    d030    d091
7426   1970      1    1    NaN     NaN     NaN     NaN  2242.0
7427   1970      1    2    NaN     NaN     NaN     NaN  2232.0
7428   1970      1    3    NaN     NaN     NaN     NaN  2210.0
7429   1970      1    4    NaN     NaN     NaN     NaN  2197.0
7430   1970      1    5    NaN     NaN     NaN     NaN  2194.0
...     ...    ...  ...    ...     ...     ...     ...     ...
12900  1984     12   27  637.0  1104.0  1063.0  1404.0  2381.0
12901  1984     12   28  624.0  1073.0  1068.0  1400.0  2357.0
12902  1984     12   29  645.0  1065.0  1074.0  1386.0  2341.0
12903  1984     12   30  646.0  1083.0  1077.0  1379.0  2356.0
12904  1984     12   31  627.0  1082.0  1060.0  1404.0  2350.0

[5479 rows x 8 columns]

In [46]:
df_70_84.isnull().sum()

Year        0
Month       0
Day         0
d011     1498
d013      852
d029     3173
d030     3214
d091        0
dtype: int64

In [47]:
df_85_20.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13149 entries, 12905 to 26053
Data columns (total 14 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   13149 non-null  int64
 1   Year    13149 non-null  int64
 2   Month   13149 non-null  int64
 3   Day     13149 non-null  int64
 4   d002    10255 non-null  float64
 5   d003    13065 non-null  float64
 6   d004    10039 non-null  float64
 7   d011    13149 non-null  float64
 8   d013    13149 non-null  float64
 9   d029    13149 non-null  float64
 10  d030    13149 non-null  float64
 11  d091    13149 non-null  float64
 12  d092    2042 non-null   float64
 13  d400    9591 non-null   float64
dtypes: float64(10), int64(4)
memory usage: 1.5 MB

In [48]:
df_85_20 = df_85_20[['Year','Month','Day', 'd011', 'd013','d029','d030','d091']]
df_85_20

       Year  Month  Day   d011    d013     d029    d030    d091
12905  1985      1    1  628.0  1061.0   1048.0  1431.0  2340.0
12906  1985      1    2  640.0  1056.0   1094.0  1438.0  2331.0
12907  1985      1    3  622.0  1046.0   1099.0  1415.0  2299.0
12908  1985      1    4  611.0  1035.0   1068.0  1413.0  2299.0
12909  1985      1    5  623.0  1021.0   1077.0  1406.0  2279.0
...     ...    ...  ...    ...     ...      ...     ...     ...
26049  2020     12   27  607.0  1076.0 -32767.0  1479.0  2380.0
26050  2020     12   28  596.0  1068.0 -32767.0  1482.0  2378.0
26051  2020     12   29  610.0  1083.0 -32767.0  1502.0  2400.0
26052  2020     12   30  637.0  1091.0   1132.0  1497.0  2420.0
26053  2020     12   31  656.0  1070.0   1133.0  1483.0  2449.0

[13149 rows x 8 columns]

In [51]:
# Valores nulos
df_85_20.isnull().sum()

Year     0
Month    0
Day      0
d011     0
d013     0
d029     0
d030     0
d091     0
dtype: int64

In [52]:
# Valores atipicos (-32767) solo en la estacion d011

df_85_20.loc[df_85_20['d011']== -32767]

       Year  Month  Day     d011    d013    d029    d030    d091
15417  1991     11   18 -32767.0  1166.0  1023.0  1566.0  2523.0
15418  1991     11   19 -32767.0  1194.0  1013.0  1577.0  2548.0
15419  1991     11   20 -32767.0  1196.0  1040.0  1578.0  2571.0
15420  1991     11   21 -32767.0  1190.0  1047.0  1577.0  2569.0
15421  1991     11   22 -32767.0  1176.0   993.0  1572.0  2561.0
...     ...    ...  ...      ...     ...     ...     ...     ...
24588  2016     12   27 -32767.0  1078.0  1129.0  1511.0  2481.0
24589  2016     12   28 -32767.0  1064.0  1098.0  1525.0  2500.0
24590  2016     12   29 -32767.0  1051.0  1077.0  1525.0  2492.0
24591  2016     12   30 -32767.0  1061.0  1113.0  1502.0  2482.0
24592  2016     12   31 -32767.0  1079.0  1112.0  1493.0  2482.0

[1117 rows x 8 columns]

In [54]:
# Remplazar valores atipicos por NaN

df_85_20.replace(-32767, np.NaN, inplace=True)#Reemplazar por NaN

In [55]:
df_85_20['d011'] = df_85_20['d011'].fillna(df_85_20.groupby('Year')['d011'].transform('mean'))
df_85_20['d013'] = df_85_20['d013'].fillna(df_85_20.groupby('Year')['d013'].transform('mean'))
df_85_20['d029'] = df_85_20['d029'].fillna(df_85_20.groupby('Year')['d029'].transform('mean'))
df_85_20['d030'] = df_85_20['d030'].fillna(df_85_20.groupby('Year')['d030'].transform('mean'))
df_85_20['d091'] = df_85_20['d091'].fillna(df_85_20.groupby('Year')['d091'].transform('mean'))

df_85_20

       Year  Month  Day   d011    d013         d029    d030    d091
12905  1985      1    1  628.0  1061.0  1048.000000  1431.0  2340.0
12906  1985      1    2  640.0  1056.0  1094.000000  1438.0  2331.0
12907  1985      1    3  622.0  1046.0  1099.000000  1415.0  2299.0
12908  1985      1    4  611.0  1035.0  1068.000000  1413.0  2299.0
12909  1985      1    5  623.0  1021.0  1077.000000  1406.0  2279.0
...     ...    ...  ...    ...     ...          ...     ...     ...
26049  2020     12   27  607.0  1076.0  1077.953368  1479.0  2380.0
26050  2020     12   28  596.0  1068.0  1077.953368  1482.0  2378.0
26051  2020     12   29  610.0  1083.0  1077.953368  1502.0  2400.0
26052  2020     12   30  637.0  1091.0  1132.000000  1497.0  2420.0
26053  2020     12   31  656.0  1070.0  1133.000000  1483.0  2449.0

[13149 rows x 8 columns]

In [56]:
df_85_20.isnull().sum()

Year        0
Month       0
Day         0
d011        0
d013     1460
d029     1461
d030        0
d091        0
dtype: int64

### Visualizaciones

In [40]:
df_85_20[['Year','d011','d013', 'd029', 'd030', 'd091']].groupby('Year').mean()

            d011         d013         d029         d030         d091
Year
1985  693.638356  1039.522152  1023.859155  1402.147945  2372.041096
1986  741.400000  1025.328767  1009.590028  1453.970588  2423.232877
1987  724.084932   968.882192   872.174157  1514.115068  2484.435616
1988  536.887978   895.857923   959.311475  1375.232240  2380.412568
1989  654.123288  1009.539726  1036.232877  1424.126027  2419.249315
1990  724.419178  1086.556164  1010.071233  1454.145205  2394.032877
1991  744.669468  1086.827397   993.556164  1501.016438  2441.936986
1992  717.330579  1049.906336   883.073770  1516.872881  2478.811475
1993  700.731507  1058.632877   932.712329  1496.339726  2458.794521
1994  724.728767  1072.140884   996.205479  1466.539726  2448.427397
1995  662.435616  1038.767123   976.164384  1437.035616  2381.231198
1996  682.642857  1032.912568  1033.218579  1427.765027  2357.740437
1997  830.742466  1092.736986   944.109589  1663.290055  2567.487671
1998  538.336986   939.175342   844.239316  1533.035616  2493.025210
1999  594.832877   972.052055  1003.126027  1433.312329  2361.114114
2000  663.472678  1019.387978  1055.072874  1446.691257  2382.196203
2001  693.916435  1021.551402  1056.005525  1459.723288  2361.203911
2002  775.312329          NaN  1004.432877  1523.821918  2424.547945
2003  685.513423          NaN  1021.353425  1476.635616  2418.315789
2004  739.057377  1116.133779  1054.816940  1479.672131  2421.178694
2005  698.594521  1080.884932  1039.147945  1472.290850  2433.347541
2006  710.304110  1083.191781  1047.249315  1518.482192  2483.497253
2007  632.230241  1044.522124  1041.821918  1430.720548  2420.161644
2008  596.858065  1002.278689  1029.672131  1477.885714  2481.782369
2009  746.408219  1089.556164  1069.681818  1498.725490  2469.460274
2010  641.920548  1012.301587          NaN  1450.484932  2438.556164
2011  660.305296  1028.975342          NaN  1472.134247  2438.472779
2012  709.528926  1034.000000          NaN  1498.784153  2466.346995
2013  707.090411          NaN          NaN  1475.162465  2461.389041
2014  792.473973          NaN  1096.807107  1538.435616  2507.090411
2015  828.100000  1247.111111  1021.013699  1625.991781  2572.660274
2016  873.250000  1069.434426  1004.505464  1511.516393  2482.250000
2017  689.895890  1085.136986  1089.340426  1515.876712  2493.772603
2018  785.356164  1146.484932  1144.104730  1541.641096  2496.232877
2019  765.961644  1166.019157  1097.395122  1534.053691  2494.054795
2020  705.920765  1093.079235  1077.953368  1495.816940  2466.516393